#ifndef INTERFACES_H
#define INTERFACES_H

/* в данном модуле описаны интерфейсные классы, определяющие, какие действия может выполнять каждое окно*/

#include <QObjectList>

/*====================================================================================================================*/

class IControlExtractor
// интерфейс предназначен для классов, которые извлекают управляющие элементы на главное окно
{
public:
    virtual QObjectList* extractControls() = 0;
};

/*====================================================================================================================*/

#endif // INTERFACES_H
